AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/gpio.c
	assert((0xFFFF != baseAddress) );
    if(0xFFFF == baseAddress)
	{
		return;
	}
    

    switch (selectedPort){
        case GPIO_PORT_P1:
            HWREG8(baseAddress + OFS_P1IFG) &= (uint8_t) ~selectedPins;
            break;
        case GPIO_PORT_P2:
            HWREG8(baseAddress + OFS_P2IFG) &= (uint8_t) ~selectedPins;
            break;
        case GPIO_PORT_PA:
            HWREG16(baseAddress + OFS_PAIFG) &= ~selectedPins;
            break;
    }
}

//*****************************************************************************
//
//! This function selects on what edge the port interrupt flag should be set
//! for a transition
//!     Note that only Port 1,2, A have this capability
//!
//! \param selectedPort is the selected port.
//!             Valid values are
//!             \b GPIO_PORT_P1,
//!             \b GPIO_PORT_P2,
//!             \b GPIO_PORT_PA,
//!             \b GPIO_PORT_PB
//! \param selectedPins is the specified pin in the selected port.
//!             Valid values are
//!             \b GPIO_PIN0,
//!             \b GPIO_PIN1,
//!             \b GPIO_PIN2,
//!             \b GPIO_PIN3,
//!             \b GPIO_PIN4,
//!             \b GPIO_PIN5,
//!             \b GPIO_PIN6,
//!             \b GPIO_PIN7
//! \param edgeSelect specifies what tranistion sets the interrupt flag
//!             Valid values are
//!             \b GPIO_HIGH_TO_LOW_TRANSITION,
//!             \b GPIO_LOW_TO_HIGH_TRANSITION
//! Modified registers are \b PxIES.
//!
//! \return None
//
//*****************************************************************************
void GPIO_interruptEdgeSelect (
    uint8_t selectedPort,
    uint16_t selectedPins,
    uint8_t edgeSelect
    )
{
    assert((GPIO_PORT_P1 == selectedPort) || (GPIO_PORT_P2 == selectedPort) );
  
     assert(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 + 
                                     GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 + 
                                     GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 + 
                                     GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                     GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +  
                                     GPIO_PIN15
             )));
			 
	uint32_t baseAddress  = privateGPIOGetBaseAddress(selectedPort);
	
	assert((0xFFFF != baseAddress) );
    if(0xFFFF == baseAddress)
	{
		return;
	}

    assert((edgeSelect == GPIO_HIGH_TO_LOW_TRANSITION) ||
        (edgeSelect == GPIO_LOW_TO_HIGH_TRANSITION)
        );

    switch (selectedPort){
        case GPIO_PORT_P1:
            if (GPIO_LOW_TO_HIGH_TRANSITION == edgeSelect){
                HWREG8(baseAddress + OFS_P1IES) &= (uint8_t) ~selectedPins;
            } else   {
                HWREG8(baseAddress + OFS_P1IES) |= (uint8_t) selectedPins;
            }
            break;

        case GPIO_PORT_P2:
            if (GPIO_LOW_TO_HIGH_TRANSITION == edgeSelect){
                HWREG8(baseAddress + OFS_P2IES) &= (uint8_t) ~selectedPins;
            } else  {
                HWREG8(baseAddress + OFS_P2IES) |= (uint8_t) selectedPins;
            }
            break;
    }
}

//*****************************************************************************
//
//! This function sets the drive strength for the selected port pin.
//!
//! \param selectedPort is the selected port.
//!             Valid values are
//!             \b GPIO_PORT_P1,
//!             \b GPIO_PORT_P2,
//!             \b GPIO_PORT_P3,
//!             \b GPIO_PORT_P4,
//!             \b GPIO_PORT_P5,
//!             \b GPIO_PORT_P6,
//!             \b GPIO_PORT_P7,
//!             \b GPIO_PORT_P8,
//!             \b GPIO_PORT_P9,
//!             \b GPIO_PORT_P10,
//!             \b GPIO_PORT_P11,
//!             \b GPIO_PORT_PA,
//!             \b GPIO_PORT_PB,
//!             \b GPIO_PORT_PC,
//!             \b GPIO_PORT_PD,
//!             \b GPIO_PORT_PE,
//!             \b GPIO_PORT_PF,
//!             \b GPIO_PORT_PJ
//! \param selectedPins is the specified pin in the selected port.
//!             Valid values are
//!             \b GPIO_PIN0,
//!             \b GPIO_PIN1,
//!             \b GPIO_PIN2,
//!             \b GPIO_PIN3,
//!             \b GPIO_PIN4,
//!             \b GPIO_PIN5,
//!             \b GPIO_PIN6,
//!             \b GPIO_PIN7,
//!             \b GPIO_PIN8,
//!             \b GPIO_PIN9,
//!             \b GPIO_PIN10,
//!             \b GPIO_PIN11,
//!             \b GPIO_PIN12,
//!             \b GPIO_PIN13,
//!             \b GPIO_PIN14,
//!             \b GPIO_PIN15
//! \param driveStrength specifies what tranistion sets the interrupt flag
//!             Valid values are
//!             \b GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH,
//!             \b GPIO_FULL_OUTPUT_DRIVE_STRENGTH
//! Modified registers are \b PxIES.
//!
//! \return None
//
//*****************************************************************************
void GPIO_setDriveStrength (
    uint8_t selectedPort,
    uint16_t selectedPins,
    uint8_t driveStrength
    )
{
    assert((GPIO_PORT_P1 == selectedPort) || (GPIO_PORT_P2 == selectedPort) ||
        (GPIO_PORT_P3 == selectedPort) || (GPIO_PORT_P4 == selectedPort) ||
        (GPIO_PORT_P5 == selectedPort) || (GPIO_PORT_P6 == selectedPort) ||
        (GPIO_PORT_P7 == selectedPort) || (GPIO_PORT_P8 == selectedPort) ||
        (GPIO_PORT_P9 == selectedPort) || (GPIO_PORT_P10 == selectedPort) ||
        (GPIO_PORT_P11 == selectedPort) || (GPIO_PORT_PA == selectedPort) ||
        (GPIO_PORT_PB == selectedPort) || (GPIO_PORT_PC == selectedPort) ||
        (GPIO_PORT_PD == selectedPort) || (GPIO_PORT_PE == selectedPort) ||
        (GPIO_PORT_PF == selectedPort) || (GPIO_PORT_PJ == selectedPort)
        );
  
     assert(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 + 
                                     GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 + 
                                     GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 + 
                                     GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                     GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +  
                                     GPIO_PIN15
             )));
			 
	uint32_t baseAddress  = privateGPIOGetBaseAddress(selectedPort);
	
	assert((0xFFFF != baseAddress) );
    if(0xFFFF == baseAddress)
	{
		return;
	}
    assert((driveStrength == GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH) ||
        (driveStrength == GPIO_FULL_OUTPUT_DRIVE_STRENGTH)
        );

    switch (selectedPort){
        case GPIO_PORT_P1:
		case GPIO_PORT_P3:
		case GPIO_PORT_P5:
		case GPIO_PORT_P7:
		case GPIO_PORT_P9:
            if (GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH == driveStrength){
                HWREG8(baseAddress + OFS_P1DS) &= (uint8_t) ~selectedPins;
            } else   {
                HWREG8(baseAddress + OFS_P1DS) |= (uint8_t) selectedPins;
            }
            break;

        case GPIO_PORT_P2:
		case GPIO_PORT_P4:
		case GPIO_PORT_P6:
		case GPIO_PORT_P8:
		case GPIO_PORT_P10:
            if (GPIO_REDUCED_OUTPUT_DRIVE_STRENGTH == driveStrength){
                HWREG8(baseAddress + OFS_P2DS) &= (uint8_t) ~selectedPins;
            } else  {
                HWREG8(baseAddress + OFS_P2DS) |= (uint8_t) selectedPins;
            }
            break;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
